tap "peonping/tap"
tap "nikitabobko/tap"
tap "FelixKratz/formulae"

# Core CLI
brew "stow"
brew "gh"
brew "starship"

# Shell tools used by .zshrc
brew "fzf"
brew "bat"
brew "eza"

# Editors
brew "vim"
brew "ripgrep"

# Notifications
brew "peonping/tap/peon-ping"

# GUI / casks
cask "claude-code"
cask "kitty"
cask "karabiner-elements"
cask "font-jetbrains-mono-nerd-font"
cask "nikitabobko/tap/aerospace"

# SketchyBar status bar (driven by aerospace workspace events)
brew "sketchybar"
brew "jq"
brew "switchaudio-osx"
cask "font-sketchybar-app-font"

# Communication / media (auto-assigned to workspaces by aerospace)
cask "slack"
cask "telegram"
cask "spotify"
