tap "peonping/tap"
tap "hashicorp/tap"
tap "nikitabobko/tap"
tap "FelixKratz/formulae"

# Core CLI
brew "stow"
brew "gh"
brew "starship"

# Shell tools used by .zshrc
brew "fzf"
brew "bat"
brew "eza"

# Editors
brew "vim"
brew "ripgrep"

# Notifications
brew "peonping/tap/peon-ping"

# GUI / casks
cask "claude"
cask "claude-code"
cask "ghostty"
cask "raycast"
cask "karabiner-elements"
cask "font-jetbrains-mono-nerd-font"
cask "nikitabobko/tap/aerospace"

# SketchyBar status bar (driven by aerospace workspace events)
brew "sketchybar"
brew "borders"               # JankyBorders, launched from aerospace after-startup-command
brew "jq"
brew "switchaudio-osx"
cask "font-sketchybar-app-font"
cask "font-sf-pro"           # SF Symbols PUA glyphs used in icons.sh (apple, battery, …)

# Browsers
cask "google-chrome"

# Communication / media (auto-assigned to workspaces by aerospace)
cask "slack"
cask "telegram"
cask "spotify"

# Containers & Kubernetes
cask "docker-desktop"
brew "kubectl"
brew "helm"
cask "freelens"

# PHP
brew "php@8.4"
brew "composer"

# Python tooling
brew "uv"                    # fast Python package manager, provides uvx for MCP servers

# Infrastructure as Code
brew "hashicorp/tap/terraform"
brew "ansible"

# Database
cask "sequel-ace"

# Screenshots
cask "shottr"

# Markdown viewer (used by raycast keybindings script)
cask "macdown"
